# 1.8 Complexe

Les nombres complexes sont pris en charge dans KC3 via le type `Complex`
et l'opérateur infixe `+i`.

## 1.8.1 Exemples

```elixir
ikc3> i = 0 +i 1
0 +i 1
ikc3> ii = i * i
-1 +i 0
ikc3> iii = i +i i
-1 +i 1
ikc3> type(i)
Complex
```

---

Top : [Documentation KC3](../)

Précédent : [1.07 Caractère](1.07_Character)

Suivant : [1.09 Cow](1.09_Cow)
