# 1.8 Complex

Complex numbers are supported in KC3 through the `Complex` type and
the `+i` infix operator.

## 1.8.1 Examples

```elixir
ikc3> i = 0 +i 1
0 +i 1
ikc3> ii = i * i
-1 +i 0
ikc3> iii = i +i i
-1 +i 1
ikc3> type(i)
Complex
```

---

Top : [KC3 documentation](../)

Previous : [1.07 Character](1.07_Character)

Next : [1.09 Cow](1.09_Cow)
