# 1.13 Ident

Le type KC3 `Ident` désigne un identifiant. Un identifiant s’évalue
selon la valeur qui lui est liée dans l’environnement courant :
d’abord dans les cadres (_frames_) locaux, puis globaux, et enfin
dans le graphe de faits (la base de données de l'environnement).

## 1.13.1 Exemples

Pour obtenir un `Ident`, vous pouvez utiliser une citation (`quote`) :

```elixir
ikc3> quote List.reverse
List.reverse
ikc3> type(quote List.reverse)
Ident
```

Pour lier une valeur à un identifiant, vous pouvez utiliser le `pattern
matching` :

```elixir
ikc3> [one, two, three | rest] = List.count(5)
[1, 2, 3, 4, 5]
ikc3> type(quote one)
Ident
ikc3> one
1
ikc3> two
2
ikc3> three
3
ikc3> rest
[4, 5]
```

Vous pouvez aussi utiliser `KC3.def` pour stocker une valeur dans la
base de faits (_graph database_) :

```elixir
ikc3> def one = 1
1
ikc3> def two = one + one
2
ikc3> two
2
```

---

Top : [Documentation KC3](../)

Précédent : [1.12 F128](1.12_F128)

Suivant : [1.14 Entier](1.14_Integer)
