# 1.18 Quote

The KC3 `Quote` type allows you for partial quotes. See `Unquote`.

Quoting is necessary for meta-programming where you want to return
a quoted value that will not be evaluated except the quote will be
removed.

## 1.18.1 Examples

```elixir
ikc3> quote 1 + 1
1 + 1
ikc3> quote quote 1 + 1
quote 1 + 1
ikc3> type(quote 1 + 1)
Call
ikc3> type(quote quote 1 + 1)
Quote
```

---

Top : [KC3 documentation](../)

Previous : [1.17 Ptr](1.17_Ptr)

Next : [1.19 Ratio](1.19_Ratio)
