# 1.20 Type Str

Chaîne de caractères en lecture seule. Utilisez `Str.size` pour obtenir
la taille de la chaîne en octets (hors terminateur NUL).
Toutes les chaînes KC3 sont terminées par un NUL et leur taille est
vérifiée.

## 1.20.1 Littéraux de chaîne et interpolation

Un littéral de chaîne commence et se termine par des guillemets doubles
`"` ou des triples guillemets `"""`. À l'intérieur d'un littéral de
chaîne, vous pouvez utiliser la syntaxe `#{expr}` pour évaluer
l'expression `expr` et insérer sa valeur (de type `Str`) dans la
chaîne.

Le littéral de chaîne est alors analysé comme un appel (`Call`) à
`KC3.str`, et non comme une valeur directe de type `Str`.
Lors de l'évaluation, tous les éléments sont concaténés en une
nouvelle chaîne `Str` via l'appel à `KC3.str`.

## 1.20.2 Exemples

```elixir
ikc3> "123"
"123"
ikc3> type("123")
Str
ikc3> b = 2
2
ikc3> "1#{b}3"
"123"
ikc3> type("1#{b}3")
Str
ikc3> quote "1#{b}3"
"1#{b}3"
ikc3> type(quote "1#{b}3")
Call
ikc3> type(quote quote "1#{b}3")
Quote
```

---

Top : [Documentation KC3](../)

Précédent : [1.19 Ratio](1.19_Ratio)

Suivant : [1.21 Structure](1.21_Struct)
