# 1.4 Booléen

Les booléens ne peuvent avoir que deux valeurs : `false` ou `true`.

Ils peuvent être convertis en types entiers, `false` valant `0` et
`true` valant `1`.

Vous pouvez convertir n'importe quel type en booléen : les entiers `0`
et le caractère NUL deviennent `false`, et tout le reste devient `true`.
Cela est utile pour les opérations conditionnelles : on accepte
n'importe quel `Tag` comme condition, et s’il est évalué à `true`
après conversion, on continue. C'est ainsi que sont implémentés
`if_then_else`, `while` et de nombreux opérateurs en KC3.

## 1.4.1 Exemples

```elixir
ikc3> true && true
true
ikc3> true && false
false
ikc3> if "" do "ok" else "ko" end
"ok"
ikc3> if 1 do "ok" else "ko" end
"ok"
ikc3> if 0 do "ko" else "ok" end
"ok"
ikc3> (Bool) ""
true
ikc3> (Bool) 1
true
ikc3> (Bool) 0
false
ikc3> "ok" == "ok"
true
ikc3> "ok" == "ko"
false
```

---

Top : [Documentation KC3](../)

Précédent : [1.03 Bloc](1.03_Block)

Suivant : [1.05 Callable](1.05_Callable)
